app/Soap/Fedex/OpenShipService/OpenShip_v13/CreateOpenShipmentRequest_Reply.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://fedex.com/ws/openship/v13">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <CreateOpenShipmentRequest>
         <WebAuthenticationDetail>
            <ParentCredential>
               <Key>RZEndj3VoTN7IZPr</Key>
               <Password>FyOhzHVSNhQOhGlOoT7R5DRAW</Password>
            </ParentCredential>
            <UserCredential>
               <Key>IwxibuPidazmPdWY</Key>
               <Password>lqPWoVeWGAFboqFOtiBU9qfCy</Password>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber>606503768</AccountNumber>
            <MeterNumber>100243452</MeterNumber>
            <Localization>
               <LanguageCode>EN</LanguageCode>
               <LocaleCode>en</LocaleCode>
            </Localization>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>BBHHTTRR33333</CustomerTransactionId>
            <Localization>
               <LanguageCode>EN</LanguageCode>
               <LocaleCode>en</LocaleCode>
            </Localization>
         </TransactionDetail>
         <Version>
            <ServiceId>ship</ServiceId>
            <Major>13</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <Index>SSS44</Index>
         <RequestedShipment>
            <ShipTimestamp>2016-12-17T09:30:47-05:00</ShipTimestamp>
            <DropoffType>REGULAR_PICKUP</DropoffType>
            <ServiceType>INTERNATIONAL_PRIORITY</ServiceType>
            <PackagingType>YOUR_PACKAGING</PackagingType>
            <TotalWeight>
               <Units>LB</Units>
               <Value>20.0</Value>
            </TotalWeight>
            <PreferredCurrency>USD</PreferredCurrency>
            <Shipper>
               <AccountNumber>606503768</AccountNumber>
               <Contact>
                  <PersonName>Pratibha</PersonName>
                  <CompanyName>SYNTEL</CompanyName>
                  <PhoneNumber>1234567890</PhoneNumber>
                  <EMailAddress>pratibha_bhujaballi@syntelinc.com</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>Sender_Address_Line1</StreetLines>
                  <City>MEMPHIS</City>
                  <StateOrProvinceCode>TN</StateOrProvinceCode>
                  <PostalCode>38118</PostalCode>
                  <CountryCode>US</CountryCode>
                  <Residential>0</Residential>
               </Address>
            </Shipper>
            <Recipient>
               <AccountNumber>606503768</AccountNumber>
               <Contact>
                  <PersonName>SENDER</PersonName>
                  <CompanyName>IBM</CompanyName>
                  <PhoneNumber>9989742135</PhoneNumber>
                  <EMailAddress>mounika_karnam@syntelinc.com</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>STREETLINE</StreetLines>
                  <City>MISSISSIAGUA</City>
                  <StateOrProvinceCode>ON</StateOrProvinceCode>
                  <PostalCode>L4W1W8</PostalCode>
                  <CountryCode>CA</CountryCode>
                  <CountryName>CANADA</CountryName>
                  <Residential>0</Residential>
               </Address>
            </Recipient>
            <ShippingChargesPayment>
               <PaymentType>SENDER</PaymentType>
               <Payor>
                  <ResponsibleParty>
                     <AccountNumber>606503768</AccountNumber>
                     <Contact>
                        <ContactId/>
                        <PersonName>Richi</PersonName>
                        <Title>Sancheti</Title>
                        <CompanyName>Syntel</CompanyName>
                        <PhoneNumber>01111111111</PhoneNumber>
                        <PhoneExtension>3698</PhoneExtension>
                        <PagerNumber>7418529337</PagerNumber>
                        <FaxNumber>3692581470</FaxNumber>
                        <EMailAddress>Richi_Sancheti@syntelinc.com</EMailAddress>
                     </Contact>
                     <Address>
                        <StreetLines>SUBIDA DEL CLUB 62</StreetLines>
                        <City>Texas</City>
                        <StateOrProvinceCode>TX</StateOrProvinceCode>
                        <PostalCode>73301</PostalCode>
                        <CountryCode>US</CountryCode>
                     </Address>
                  </ResponsibleParty>
               </Payor>
            </ShippingChargesPayment>
            <ProcessingOptionsRequested>
               <Options>PACKAGE_LEVEL_COMMODITIES</Options>
            </ProcessingOptionsRequested>
            <CustomsClearanceDetail>
               <DutiesPayment>
                  <PaymentType>SENDER</PaymentType>
                  <Payor>
                     <ResponsibleParty>
                        <AccountNumber>606503768</AccountNumber>
                        <Tins>
                           <TinType>BUSINESS_STATE</TinType>
                           <Number>213456</Number>
                        </Tins>
                        <Contact>
                           <ContactId>12345</ContactId>
                           <PersonName>shriyash</PersonName>
                        </Contact>
                     </ResponsibleParty>
                  </Payor>
               </DutiesPayment>
               <DocumentContent>DOCUMENTS_ONLY</DocumentContent>
               <CustomsValue>
                  <Currency>USD</Currency>
                  <Amount>100.00</Amount>
               </CustomsValue>
               <CommercialInvoice>
                  <TermsOfSale>DAP</TermsOfSale>
               </CommercialInvoice>
               <ExportDetail>
                  <ExportComplianceStatement>30.37(f)</ExportComplianceStatement>
               </ExportDetail>
            </CustomsClearanceDetail>
            <LabelSpecification>
               <Dispositions>
                  <DispositionType>STORED</DispositionType>
               </Dispositions>
               <LabelFormatType>COMMON2D</LabelFormatType>
               <ImageType>PNG</ImageType>
               <LabelStockType>PAPER_4X6</LabelStockType>
               <LabelPrintingOrientation>TOP_EDGE_OF_TEXT_FIRST</LabelPrintingOrientation>
            </LabelSpecification>
            <RateRequestTypes>LIST</RateRequestTypes>
            <PackageCount>1</PackageCount>
            <RequestedPackageLineItems>
               <SequenceNumber>1</SequenceNumber>
               <GroupPackageCount>1</GroupPackageCount>
               <Weight>
                  <Units>LB</Units>
                  <Value>20.0</Value>
               </Weight>
               <Dimensions>
                  <Length>12</Length>
                  <Width>12</Width>
                  <Height>12</Height>
                  <Units>IN</Units>
               </Dimensions>
            </RequestedPackageLineItems>
         </RequestedShipment>
      </CreateOpenShipmentRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

Out:
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <CreateOpenShipmentReply xmlns="http://fedex.com/ws/openship/v13">
         <HighestSeverity>SUCCESS</HighestSeverity>
         <Notifications>
            <Severity>SUCCESS</Severity>
            <Source>ship</Source>
            <Code>0000</Code>
            <Message>Success</Message>
            <LocalizedMessage>Success</LocalizedMessage>
         </Notifications>
         <TransactionDetail>
            <CustomerTransactionId>BBHHTTRR33333</CustomerTransactionId>
            <Localization>
               <LanguageCode>EN</LanguageCode>
               <LocaleCode>en</LocaleCode>
            </Localization>
         </TransactionDetail>
         <Version>
            <ServiceId>ship</ServiceId>
            <Major>13</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <JobId>35ce2637d3202ds01516j211125</JobId>
         <AsynchronousProcessingResults>
            <Options>SYNCHRONOUSLY_PROCESSED</Options>
         </AsynchronousProcessingResults>
         <CompletedShipmentDetail>
            <UsDomestic>false</UsDomestic>
            <CarrierCode>FDXE</CarrierCode>
            <MasterTrackingId>
               <TrackingIdType>FEDEX</TrackingIdType>
               <FormId>0430</FormId>
               <TrackingNumber>794890385077</TrackingNumber>
            </MasterTrackingId>
            <ExportComplianceStatement>30.37(f)</ExportComplianceStatement>
            <CompletedPackageDetails>
               <SequenceNumber>1</SequenceNumber>
               <TrackingIds>
                  <TrackingIdType>FEDEX</TrackingIdType>
                  <FormId>0430</FormId>
                  <TrackingNumber>794890385077</TrackingNumber>
               </TrackingIds>
               <GroupNumber>0</GroupNumber>
            </CompletedPackageDetails>
         </CompletedShipmentDetail>
         <Index>SSS44</Index>
      </CreateOpenShipmentReply>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>